{
  "MAIL_SUBJECT": "aeSecure QuickScan - Demande de conseil",
  "MAIL_BODY": "<p>Bonjour aeSecure,</p><p>Merci de trouver ci-joint une archive contenant un ou plusieurs fichiers que j'aimerai porter à votre connaissance.</p><p>%s</p><p>Pourriez-vous m'indiquer s'il s'agit d'un virus ou si le fichier est sain&nbsp;?</p><p>D'avance, merci.</p><hr/><p><em>J'ai bien pris connaissance du fait que ce service est réalisé bénévolement et que selon votre charge de travail, je pourrais ne pas avoir de réponse rapidement.</em></p>",
  "SELECT_LANGUAGE": "Sélectionnez votre langue",
  "SCANFILES": "Scanne %s fichier(s)",
  "QUICKSCANFAQ": "Pour trouver une réponse à ce problème, merci de consulter la <a href=\"%s#faqs\" target=\"_blank\">FAQ d'aeSecure QuickScan</a>",
  "ALERTINFO": "Ce script, proposé à titre gracieux par <a href=\"%s\" target=\"_blank\">aeSecure</a>, logiciel de protection et d'optimisation de sites web Apache, va scanner l'ensemble de votre site à la recherche de quelques 'signatures' (patterns) de virus <span style=\"font-style:italic;\">(pour des raisons de performance, les fichiers de plus de %s seront ignorés).</span><span class=\"newline underline\">L'action du script est de faire un scan : aucune suppression de fichier ne sera faite; il n'y a donc aucun risque de l'exécuter sur votre site.</span>",
  "VEL_EXPLAINED": "<div class='text-info' style='font-size:small;'>La liste des extensions vulnérables (VEL) est maintenue par <a href=\"http://vel.joomla.org/\" target=\"_blank\" title=\"Joomla!® Vulnerable Extensions List\">Joomla.org</a>, le fichier utilisé par QuickScan provient du site <a href=\"%s\" target=\"_blank\">%s</a> et est téléchargé automatiquement.</div>",
  "FILESFOUND": "%d fichiers ont été analysés dont %d sont détectés comme <span class=\"double_underline\" data-toggle=\"popover\" data-html=\"true\" data-content=\"%s\">potentiellement</span> dangereux.<br/>%d fichiers ont été ignorés car ayant une taille supérieure ou égale à %d MB et %d fichier(s) inaccessible(s) à cause d'un niveau de permission (chmod) trop restreint.",
  "VIRUSFOUND": "Si les résultats de ce script ont démontré la présence de virus, veuillez bien comprendre que le script a cherché des fichiers connus comme malsain (blacklist) et qu'il a recherché qu'un tout petit nombre de possibilités de hacking. Seules quelques signatures; simples; ont été recherchées. Il faut donc vous attendre à ce que vous ayez d'autres virus sur votre site web et il faudrait considérer un scan complet du site pour les éliminer. N'hésitez pas à me contacter : <a href=\"%s\" target=\"_blank\">%s</a>, je peux nettoyer votre site web.",
  "JS_CONFIRMSENDBYMAIL": "Vous êtes sur le point d'envoyer un email au développeur d'aeSecure avec un ou plusieurs fichiers pour analyse. <span class='text-danger'>Ne faites pas cela si le contenu des fichiers est confidentiel!</span><br/><br/><strong class=\"text-warning\">Attention : ce service gratuit est minimal, vous recevrez dès que faire se peut une réponse automatisée indiquant si les fichiers soumis sont malsains ou non. Ensuite, si vous le souhaitez, n'hésitez pas à prendre contact avec le développeur d'aeSecure qui peut nettoyer votre site (<a href=\"%s\" target=\"_blank\">Plus d'infos</a>).</strong><br/><br/>Cliquez sur le bouton Envoyer seulement si vous souhaitez l'envoi des fichiers.",
  "GETCOUNTFILESDONE": "%s fichiers vont être analysés <strong id=\"virusalreadyfound\" class=\"text-danger blink\">dont %s déjà identifiés comme virus</strong> <span class=text-success\">(%s fichiers ont été ignorés car ils sont repris sur la liste blanche d'aeSecure et %s ignorés comme paramétré dans l'écran des options avancées)</span>.",
  "FILES": "%s fichiers",
  "ERROR_NOFILESFOUND": "<div class='text-danger'>Désolé, aucun fichier n'a été trouvé dans ce dossier.</div>",
  "VEL_TABLEINFO": "<div class='text-info' style='font-size:small;'>Si le tableau ci-dessous, filtré sur la première colonne, ne donne aucun résultat, cela signifie qu'aucune extension vulnérable n'a été trouvée sur votre site, bravo!</div>",
  "USINGHASHES": "Optimisation du scan",
  "USINGHASHESINFO": "Les empreintes des fichiers natifs de votre site %s %s ont pû être téléchargées, elles seront utilisées pour accélérer le scan de votre site : les fichiers du CMS présents sur votre site et qui n'ont jamais été altérés seront donc ignorés.",
  "USINGHASHESSHORT": "Empreintes trouvées",
  "SORRYNOHASHES": "Désolé, les signatures des fichiers pour la version %s de %s n'ont pas été trouvées; le scan du site sera donc bien plus long.",
  "NOTUSINGHASHESSHORT": "Empreintes non trouvées",
  "CLEANFOLDER": "Le dossier %s a été nettoyé",
  "CLEANING_URL": "https://www.aesecure.com/fr/telechargement.html#services",
  "CLEANFORYOU": "Je nettoie votre site",
  "GETTINGFILES": "Obtention de la liste des fichiers...  Merci de patienter.",
  "WHITE_LIST_HINT": "<strong>Marque ce fichier comme sain</strong><br/>Si vous souhaitez ne plus voir ce fichier repris dans la liste des fichiers suspects; ajoutez-le à la liste des fichiers sains.",
  "JS_CONFIRMKILL": "Êtes-vous sûr de souhaiter supprimer le fichier %s ?",
  "JS_CANCELSENDBYMAIL": "Vous avez annulé l'envoi, aucun fichier n'a été transmis par email.",
  "JS_YOUREMAILSENDBYMAIL": "Merci d'indiquer votre adresse email ci-dessous",
  "JS_NOTHINGTOSENDBYMAIL": "Il n'y a aucun fichier à envoyer par email",
  "JS_UNLINKSUCCESS": "<div class=\"alert alert-success\"><strong>Le fichier a été supprimé</strong></div>",
  "JS_FILENOTFOUND": "<div class=\"alert alert-danger\"><strong>Fichier non trouvé ou en lecture seule</strong></div>",
  "JS_UNLINKERROR": "<div class=\"alert alert-success\"><strong>Le fichier n'a pas pu être supprimé</strong> Erreur inconnue</div>",
  "JS_KEEPWHITELIST": "En ayant marqué certains fichiers comme sains, aeSecure a créé un fichier aesecure_quickscan.whitelist.json sur votre site.\\n\\nSouhaitez-vous conserver ce fichier afin que, la prochaine fois que vous utilisez à nouveau aeSecure QuickScan, vos fichiers ayant été marqués comme sain le soient à nouveau ?\\n\\nCliquez sur OK pour le garder.",
  "WHITE_LIST": "Marque ce fichier comme sain",
  "POTENTIALLY": "<strong>Comprennez bien que les fichiers mentionnés ci-dessous ne sont pas forcément des virus, le nombre de \"faux-positifs\" étant très élevés.</strong> Un faux-positif est un fichier qui est mentionné dans les résultats du scan mais n'étant pas un virus.",
  "MD5": "Hash du fichier basé sur son contenu (si le contenu est changé ne serait-ce que d'un seul octet, le hash sera totalement différent).",
  "KILL_FILE": "Supprimer ce fichier",
  "KILL_FILE_HINT": "<span class='text-danger' style='font-size:1.2em;'><strong>Suppression du fichier</strong><br/>Après confirmation de votre part; le fichier sera définitivement supprimé du serveur.<hr/>Cette opération est risquée et pourrait mener à un dysfonctionnement de votre site.</span>",
  "SEND_BY_MAIL": "Envoyez par email",
  "SEND_BY_MAIL_HINT": "Envoyez ce fichier par email à aeSecure pour demander sa révision : est-ce un virus ou pas ?",
  "SEE_FILE": "Voir le contenu du fichier",
  "SEE_FILE_HINT": "<strong>Voir le contenu du fichier</strong><br/>Ouvre un nouvel onglet dans votre navigateur afin d'y afficher le code source du fichier.<hr/><span class='text-success'>Si le fichier est un fichier php, il n'est aucunement exécuté; il ny a donc aucun risque de voir le contenu d'un fichier malsain.</span>",
  "HIGHPROBALITYBADSITE": "Ce site est connu comme étant malsain",
  "HIGHPROBALITYBASE64KEYWORD": "Ce mot est un mot ayant été encodé en base64 et correspondant à une mot réservé de php comme p.ex. $_SERVER ou $_COOKIES.  Il y a de fortes chances qu'il s'agisse d'un code malsain.",
  "HIGHPROBALITY": "Forte probabilité qu'il s'agisse d'un fichier ayant été virusé ou étant un virus",
  "WARNINGNOTMANDATORYAVIRUS": "Il ne s'agit pas forcément d'un virus!; la signature recherchée est également utilisée dans du code légitime.",
  "DIRNOTFOUND": "Le dossier %s n'existe pas",
  "SCANFOLDER": "Dossier à analyser :",
  "BADCHMOD": "Ce fichier est inaccessible; son 'chmod' n'en permets pas la lecture.",
  "UNREADABLE": "Ce fichier, bien que son chmod soit correct, est illisible; peut-être à cause de caractères spéciaux dans son nom",
  "TOOBIG": "Ce fichier a été ignoré car sa taille excède la taille max. autorisée (%s)",
  "INFO": "Information",
  "SAFE": "Sain",
  "STATUS": "Statut",
  "SUCCESS": "Succès",
  "LASTMOD": "Date dernière modif.",
  "DEBUGMODEENABLED": "Mode de debugging activé (Le fichier %s sera utilisé pour le logging)",
  "NOTHINGFOUND": "Bonne nouvelle ! Aucune signature dangereuse n’a été détectée dans vos fichiers.  Attention toutefois, ce scan n'est en aucun cas exhaustif.",
  "HIDERESULT": "Masquer ce résultat",
  "HIGHPROBALITYFALSEGIF": "Ce fichier semble être une fausse image : il contient un marqueur GIF ainsi que du code php; il s'agit donc très probablement d'un virus.",
  "BTNVEL": "Vulnérabilités",
  "BTNVELHINT": "Répertorie les extensions sur votre site qui seraient connues comme vulnérable",
  "RUNNING": "Analyse en cours...",
  "ALERTWARNING": "Quelques considérations à bien comprendre : <br/><br/><ol><li>Le scan est superficiel et en aucun cas exhaustif; seules quelques signatures sont recherchées alors que les possibilités de hack sont fort nombreuses,</li><li>si le script détecte la présence de certaines signatures (p.ex. \"base64_decode\"), cela n'implique pas que votre site ait été hacké. En effet, certaines instructions sont utilisées lors de hack (base64_decode) mais sont également utilisées de manière parfaitement légitime dans des codes sources php,</li><li>Les résultats retournés doivent <strong>TOUJOURS</strong> être correctement compris avant de prendre une quelconque action, demandez de l'aide sur un forum p.ex. si vous doutez.</li><li>Soyez patient :  le scan se fait fichier par fichier et peut donc être plus ou moins long; dépendant de la complexité de votre site.</li></ol>L'auteur du script décline toute responsabilité en cas de mauvais usage du script ou d'actions prises par le webmaster suite aux résultats mentionnés.",
  "PATTERN": "Signature",
  "FOUNDPOSITION": "Trouvé en position <strong>%s</strong> du fichier; voici le contexte :",
  "BLACKLISTED": "<strong class=\"text-danger\">Ce fichier est repris dans la liste noire; il contient du code malsain. Conseil : supprimez-le.</strong>",
  "DANGER": "Danger",
  "WARNING": "Attention",
  "BTNCLEAN": "Nettoyer les dossiers cache et temp",
  "BTNCLEANDONE": "Nettoyé",
  "BTNCLEANHINT": "En nettoyant au préalable votre site, vous réduisez le nombre de fichiers à scanner; le san sera donc plus rapide",
  "PAGETITLE": "aeSecure QuickScan - Script php on-site de détection de malwares",
  "BTNKILLME": "Supprimer ce script du serveur",
  "BTNKILLMEDONE": "Script supprimé",
  "BTNKILLMEHINT": "Ne laissez pas ce script sur votre serveur : votre analyse terminée, cliquez sur ce bouton pour que ce script soit supprimé.",
  "BTNSENDFILESBYMAIL": "Envoyer à aeSecure",
  "BTNSENDFILESBYMAILHINT": "Envoie les fichiers par email à aesecure.com",
  "THOUSANDSEPARATOR": ".",
  "HOME": "https://www.aesecure.com/fr",
  "HOMETITLE": "aeSecure, protection et optimisation de sites Web apache",
  "QUICKSCANURL": "https://www.aesecure.com/fr/blog/aesecure-quickscan.html",
  "DESCRIPTION": "aeSecure QuickScan est un script php a deposer sur son site web et a lancer depuis une URL afin de scanner son site a la recherche de virus tels que des malwares, trojan, Black hat SEO, ...",
  "BTNGETLIST": "Obtention de la liste des fichiers",
  "BTNGETLISTHINT": "Veuillez cliquer sur ce bouton afin d'initialiser le scanner et lui permettre de déterminer le nombre de fichiers qui seront scannés.",
  "BTNSCAN": "Scanner le site",
  "BTNSCANHINT": "Lance le scan du site; cette opération peut être longue.",
  "IGNORE_ARCHIVE": "Archives",
  "IGNORE_DOCUMENTS": "Documents",
  "IGNORE_FONT": "Fontes web",
  "IGNORE_IMAGES": "Images",
  "IGNORE_MEDIA": "Medias (autre qu'images)",
  "IGNORE_MOVIES": "Animations",
  "IGNORE_TEXTES": "Textes (autre que html)",
  "IGNORE_EXTENSIONS": "Ignore les extensions suivantes : %s",
  "EXPERT_MAXFILES": "Par paquet de %s fichiers",
  "ALL": "Tout",
  "APPLY": "Appliquer",
  "ADVANCED_OPTIONS": "Options avancées",
  "EXPERT_MODE": "Mode expert",
  "DEBUG_MODE": "Mode debug",
  "CANCEL": "Annuler",
  "SEND": "Envoyer",
  "OK": "Ok",
  "IGNORE_TITLE": "Ignorer les fichiers suivant:"
}
