{
    "ADVANCED_OPTIONS": "Options avancées",
    "ALERTINFO": "Ce script va scanner l'ensemble de votre site à la recherche de quelques 'signatures' (patterns) de virus <span style=\"font-style:italic;\">(pour des raisons de performance, les fichiers de plus de %s seront ignorés).</span><span class=\"newline underline\">L'action du script est de faire un scan : aucune suppression de fichier ne sera faite; il n'y a donc aucun risque de l'exécuter sur votre site.</span>",
    "ALERTWARNING": "Quelques considérations à bien comprendre : <br/><br/><ol><li>Le scan est superficiel et en aucun cas exhaustif; seules quelques signatures sont recherchées alors que les possibilités de hack sont fort nombreuses,</li><li>si le script détecte la présence de certaines signatures (p.ex. \"base64_decode\"), cela n'implique pas que votre site ait été hacké. En effet, certaines instructions sont utilisées lors de hack (base64_decode) mais sont également utilisées de manière parfaitement légitime dans des codes sources php,</li><li>Les résultats retournés doivent <strong>TOUJOURS</strong> être correctement compris avant de prendre une quelconque action, demandez de l'aide sur un forum p.ex. si vous doutez.</li><li>Soyez patient :  le scan se fait fichier par fichier et peut donc être plus ou moins long; dépendant de la complexité de votre site.</li></ol>L'auteur du script décline toute responsabilité en cas de mauvais usage du script ou d'actions prises par le webmaster suite aux résultats mentionnés.",
    "ALL": "Tout",
    "APPLY": "Appliquer",
    "BADCHMOD": "Ce fichier est inaccessible; son 'chmod' n'en permets pas la lecture.",
    "BLACKLISTED": "<strong class=\"text-danger\">Ce fichier est repris dans la liste noire; il contient du code malsain. Conseil : supprimez-le.</strong>",
    "BTNCLEAN": "Nettoyer les dossiers cache et temp",
    "BTNCLEANDONE": "Nettoyé",
    "BTNCLEANHINT": "En nettoyant au préalable votre site, vous réduisez le nombre de fichiers à scanner; le san sera donc plus rapide",
    "BTNGETLIST": "Obtention de la liste des fichiers",
    "BTNGETLISTHINT": "Veuillez cliquer sur ce bouton afin d'initialiser le scanner et lui permettre de déterminer le nombre de fichiers qui seront scannés.",
    "BTNKILLME": "Supprimer ce script du serveur",
    "BTNKILLMEDONE": "Script supprimé",
    "BTNKILLMEHINT": "Ne laissez pas ce script sur votre serveur : votre analyse terminée, cliquez sur ce bouton pour que ce script soit supprimé.",
    "BTNSCAN": "Scanner le site",
    "BTNSCANHINT": "Lance le scan du site; cette opération peut être longue.",
    "CANCEL": "Annuler",
    "CLEANFOLDER": "Le dossier %s a été nettoyé",
    "CONTAINAVIRUS":"Fichier(s) qui contient un virus",
    "DANGER": "Danger",
    "DEBUG_MODE": "Mode debug",
    "DEBUGMODEENABLED": "Mode de debugging activé (Le fichier %s sera utilisé pour le logging)",
    "DESCRIPTION": "aeSecure QuickScan est un script php a deposer sur son site web et a lancer depuis une URL afin de scanner son site a la recherche de virus tels que des malwares, trojan, Black hat SEO, ...",
    "DIRNOTFOUND": "Le dossier %s n'existe pas",
    "EDITED": "<strong class=\"text-danger\">Ce fichier contient un virus, il faut l'éditer pour en supprimer le code vérolé.</strong>",
    "ERROR_NOFILESFOUND": "<div class='text-danger'>Désolé, aucun fichier n'a été trouvé dans ce dossier.</div>",
    "EXPERT_MAXFILES": "Par paquet de %s fichiers",
    "EXPERT_MODE": "Mode expert",
    "FILES": "%s fichiers",
    "FILESFOUND": "%d fichiers ont été analysés dont %d sont détectés comme <span class=\"double_underline\" data-toggle=\"popover\" data-html=\"true\" data-content=\"%s\">potentiellement</span> dangereux.<br/>%d fichiers ont été ignorés car ayant une taille supérieure ou égale à %d MB et %d fichier(s) inaccessible(s) à cause d'un niveau de permission (chmod) trop restreint.",
    "FOUNDPOSITION": "Trouvé en position <strong>%s</strong> du fichier; voici le contexte :",
    "GETCOUNTFILESDONE": "%s fichiers vont être analysés <strong id=\"virusalreadyfound\" class=\"text-danger blink\">dont %s déjà identifiés comme virus</strong> <strong id=\"virusaddedfound\" class=\"text-danger blink\">et %s contenant des virus</strong> <span class=text-success\">(%s fichiers ont été ignorés car ils sont repris sur la liste blanche d'aeSecure et %s ignorés comme paramétré dans l'écran des options avancées)</span>.",
    "GETTINGFILES": "Obtention de la liste des fichiers...  Merci de patienter.",
    "HIDERESULT": "Masquer ce résultat",
    "HIGHPROBALITY": "Forte probabilité qu'il s'agisse d'un fichier ayant été virusé ou étant un virus",
    "HIGHPROBALITYBADSITE": "Ce site est connu comme étant malsain",
    "HIGHPROBALITYBASE64KEYWORD": "Ce mot est un mot ayant été encodé en base64 et correspondant à une mot réservé de php comme p.ex. $_SERVER ou $_COOKIES.  Il y a de fortes chances qu'il s'agisse d'un code malsain.",
    "HIGHPROBALITYFALSEGIF": "Ce fichier semble être une fausse image : il contient un marqueur GIF ainsi que du code php; il s'agit donc très probablement d'un virus.",
    "HOME": "https://www.avonture.be",
    "HOMETITLE": "AVONTURE Christophe aka cavo789",
    "IGNORE_ARCHIVE": "Archives",
    "IGNORE_DOCUMENTS": "Documents",
    "IGNORE_EXTENSIONS": "Ignore les extensions suivantes : %s",
    "IGNORE_FONT": "Fontes web",
    "IGNORE_IMAGES": "Images",
    "IGNORE_MEDIA": "Medias (autre qu'images)",
    "IGNORE_MOVIES": "Animations",
    "IGNORE_TEXTES": "Textes (autre que html)",
    "IGNORE_TITLE": "Ignorer les fichiers suivant:",
    "INFO": "Information",
    "ISAVIRUS":"Ce fichier est un virus",
    "JS_CONFIRMKILL": "Êtes-vous sûr de souhaiter supprimer le fichier %s ?",
    "JS_FILENOTFOUND": "<div class=\"alert alert-danger\"><strong>Fichier non trouvé ou en lecture seule</strong></div>",
    "JS_KEEPWHITELIST": "En ayant marqué certains fichiers comme sains, aeSecure a créé un fichier aesecure_quickscan.whitelist.json sur votre site.\\n\\nSouhaitez-vous conserver ce fichier afin que, la prochaine fois que vous utilisez à nouveau aeSecure QuickScan, vos fichiers ayant été marqués comme sain le soient à nouveau ?\\n\\nCliquez sur OK pour le garder.",
    "JS_UNLINKERROR": "<div class=\"alert alert-success\"><strong>Le fichier n'a pas pu être supprimé</strong> Erreur inconnue</div>",
    "JS_UNLINKSUCCESS": "<div class=\"alert alert-success\"><strong>Le fichier a été supprimé</strong></div>",
    "KILL_FILE_HINT": "<span class='text-danger' style='font-size:1.2em;'><strong>Suppression du fichier</strong><br/>Après confirmation de votre part; le fichier sera définitivement supprimé du serveur.<hr/>Cette opération est risquée et pourrait mener à un dysfonctionnement de votre site.</span>",
    "KILL_FILE": "Supprimer ce fichier",
    "LASTMOD": "Date dernière modif.",
    "MD5": "Hash du fichier basé sur son contenu (si le contenu est changé ne serait-ce que d'un seul octet, le hash sera totalement différent).",
    "NOTHINGFOUND": "Bonne nouvelle ! Aucune signature dangereuse n’a été détectée dans vos fichiers.  Attention toutefois, ce scan n'est en aucun cas exhaustif.",
    "NOTUSINGHASHESSHORT": "Empreintes non trouvées",
    "OK": "Ok",
    "PAGETITLE": "aeSecure QuickScan - Script php on-site de détection de malwares",
    "PATTERN": "Signature",
    "POTENTIALLY": "<strong>Comprennez bien que les fichiers mentionnés ci-dessous ne sont pas forcément des virus, le nombre de \"faux-positifs\" étant très élevés.</strong> Un faux-positif est un fichier qui est mentionné dans les résultats du scan mais n'étant pas un virus.",
    "QUICKSCANFAQ": "Pour trouver une réponse à ce problème, merci de consulter la <a href=\"%s#faqs\" target=\"_blank\">FAQ d'aeSecure QuickScan</a>",
    "RUNNING": "Analyse en cours...",
    "SAFE": "Sain",
    "SCANFILES": "Scanne %s fichier(s)",
    "SCANFOLDER": "Dossier à analyser :",
    "SEE_FILE_HINT": "<strong>Voir le contenu du fichier</strong><br/>Ouvre un nouvel onglet dans votre navigateur afin d'y afficher le code source du fichier.<hr/><span class='text-success'>Si le fichier est un fichier php, il n'est aucunement exécuté; il ny a donc aucun risque de voir le contenu d'un fichier malsain.</span>",
    "SEE_FILE": "Voir le contenu du fichier",
    "SELECT_LANGUAGE": "Sélectionnez votre langue",
    "SEND": "Envoyer",
    "SORRYNOHASHES": "Désolé, les signatures des fichiers pour la version %s de %s n'ont pas été trouvées; le scan du site sera donc bien plus long.",
    "STATUS": "Statut",
    "SUCCESS": "Succès",
    "THOUSANDSEPARATOR": ".",
    "TOOBIG": "Ce fichier a été ignoré car sa taille excède la taille max. autorisée (%s)",
    "UNREADABLE": "Ce fichier, bien que son chmod soit correct, est illisible; peut-être à cause de caractères spéciaux dans son nom",
    "USINGHASHES": "Optimisation du scan",
    "USINGHASHESINFO": "Les empreintes des fichiers natifs de votre site %s %s ont pû être téléchargées, elles seront utilisées pour accélérer le scan de votre site : les fichiers du CMS présents sur votre site et qui n'ont jamais été altérés seront donc ignorés.",
    "USINGHASHESSHORT": "Empreintes trouvées",
    "VIRUSFOUND": "Si les résultats de ce script ont démontré la présence de virus, veuillez bien comprendre que le script a cherché des fichiers connus comme malsain (blacklist) et qu'il a recherché qu'un tout petit nombre de possibilités de hacking. Seules quelques signatures; simples; ont été recherchées. Il faut donc vous attendre à ce que vous ayez d'autres virus sur votre site web et il faudrait considérer un scan complet du site pour les éliminer. N'hésitez pas à me contacter : <a href=\"%s\" target=\"_blank\">%s</a>, je peux nettoyer votre site web.",
    "WARNING": "Attention",
    "WARNINGBASE64ENCODEDPATTERN": "Les auteurs de virus utilisent parfois le codage \"en base64\" pour masquer leur code viral; certains mots clefs PHP comme \"eval\" ou \"system\" p.ex. permettent l'exécution d'un code et la signature qui est mentionnée ici peut-être risquée. Pour décoder du code base64, vous pouvez utiliser différents décodeur \"base64_decode\" disponible sur le net dont p.ex. https://base64.avonture.be/",
    "WARNINGNOTMANDATORYAVIRUS": "Il ne s'agit pas forcément d'un virus, le mot clef utilisé est néanmoins suspect.",
    "WHITE_LIST_HINT": "<strong>Marque ce fichier comme sain</strong><br/>Si vous souhaitez ne plus voir ce fichier repris dans la liste des fichiers suspects; ajoutez-le à la liste des fichiers sains.",
    "WHITE_LIST": "Marque ce fichier comme sain"
}
