{
    "ADVANCED_OPTIONS": "Geavanceerde opties",
    "ALERTINFO": "Dit script zal uw ganse site scannen om te zoeken naar een aantal virus 'patronen' <span style=\"font-style:italic;\">(Vanwege de prestaties, worden  bestanden groter dan %s genegeerd).</span><span class=\"newline underline\">Het script zal een scan uitvoeren maar standaard zal geen enkel bestand worden verwijderd, zodat er geen risico is bij het uit voeren op uw site.</span>",
    "ALERTWARNING": "Enkele overwegingen om te begrijpen &nbsp;:&nbsp;<br/><br/><ol><li>De scan is oppervlakkig en niet diepgaand; slechts een paar handtekeningen zijn doorzocht terwijl de mogelijkheden van hacken zeer talrijk zijn,</li><li>als het script de aanwezigheid van bepaalde handtekeningen (bijv. \"base64_decode\") detecteert. Dit betekent niet dat uw site is gehackt. Sterker nog, sommige instructies gebruikt in een hack (zoals base64_decode), maar worden ook gebruikt in veilige broncode </li><li>De resultaten moeten <strong>ALTIJD</strong>goed worden begrepen alvorens actie te ondernemen. Vraag om hulp op bvb. een forum als je twijfelt </li><li> Dit script is niet geoptimaliseerd:.. de scan is bestand gedaan bestand na bestand en kan meer of minder tijd vragen, afhankelijk van de complexiteit van uw site </li></ol> De auteur van het script aanvaardt geen enkele verantwoordelijkheid of eventuele aansprakelijkheid voor het misbruik van het script of acties genomen door de gebruiker (webmaster).",
    "ALL": "Alles",
    "APPLY": "Toepassen",
    "BADCHMOD": "Dit bestand is niet toegankelijk: de 'chmod' laat niet toe het te lezen.",
    "BLACKLISTED": "<strong class=\"text-danger\">Dit bestand staat bekend als slecht. Tip: verwijderen.</strong>",
    "BTNCLEAN": "Wis de cache en temp mappen",
    "BTNCLEANDONE": "Opgekuist",
    "BTNCLEANHINT": "Door eerst onnodige bestanden te verwijderen (cache en temp mappen), vermindert het aantal te scannen bestanden en gaat dit sneller.",
    "BTNGETLIST": "lijst bestanden ophalen",
    "BTNGETLISTHINT": "Klik op deze knop om de scanner te initialiseren en om het aantal te scannen bestanden te bepalen",
    "BTNKILLME": "Verwijder het script van de server",
    "BTNKILLMEDONE": "Script verwijderd",
    "BTNKILLMEHINT": "Bewaar dit script niet op je server. Na de analyse, klik op deze knop om het script te verwijderen.",
    "BTNSCAN": "Scan de site",
    "BTNSCANHINT": "Beginnen met het scannen van de site: dit kan even duren.",
    "CANCEL": "Annuleer",
    "CLEANFOLDER": "De map %s is opgekuisd",
    "DANGER": "Gevaarlijk",
    "DEBUGMODEENABLED": "Debugging mode is ingeschakeld (het %s) bestand zal worden gebruikt voor logging)",
    "DEBUG_MODE": "Debug mode",
    "DESCRIPTION": "aeSecure QuickScan is een php-script om op uw website te zetten en te starten vanaf een URL om zo uw website te scannen en te zoeken naar virussen, malware, trojans, Black hat SEO, ...",
    "DIRNOTFOUND": "De %s map bestaat niet.",
    "EDITED": "<strong class=\"text-danger\">Dit bestand bevat een virus, je moet het bewerken om de geïnfecteerde code te verwijderen</strong>",
    "ERROR_NOFILESFOUND": "<div class='text-danger'>Sorry, geen bestanden gevonden in deze folder.</div>",
    "EXPERT_MAXFILES": "%s bestanden in 1 keer",
    "EXPERT_MODE": "Expert mode",
    "FILES": "%s bestanden",
    "FILESFOUND": "%d bestanden geanalyseerd waarvan %d  <span class=\"double_underline\" data-toggle=\"popover\" data-html=\"true\" data-content=\"%s\">potentieel </span> gevaarlijk.\n<br/>%d bestanden genegeerd, omdat ze groter waren dan of gelijk aan %d MB en %d bestanden ontoegankelijk waren wegens te restrictieve bestandsrechten (chmod).",
    "FOUNDPOSITION": "Gevonden in positie<strong>%s</strong> in het bestand; hier is de inhoud:",
    "GETCOUNTFILESDONE": "%s bestanden zullen worden nagezien <strong id=\"virusalreadyfound\" class=\"text-danger blink\">met %s reeds geïdentificeerde virussen bestanden</strong> <strong id=\"virusaddedfound\" class=\"text-danger blink\">en met %s virussen in voorheen gezonde bestanden</strong> <span class=text-success\">(%s bestanden overgeslagen omdat in de witte lijst van aeSecure staan en %s genegeerd zoals ingesteld bij geavanceerde opties)</span>.",
    "GETTINGFILES": "De bestandslijst ophalen... Even geduld.",
    "HIDERESULT": "Verberg dit resultaat",
    "HIGHPROBALITY": "Met hoge waarschijnlijkheid is dit bestand een virus of is het besmet met een virus.",
    "HIGHPROBALITYBADSITE": "Deze website is bekend als slecht",
    "HIGHPROBALITYBASE64KEYWORD": "Dit is een base64 gecodeerd woord en komt overeen met een php gereserveerd woord als bijv. $ _SERVER Of $ _COOKIE. Deze code is mogelijks gevaarlijk.",
    "HIGHPROBALITYFALSEGIF": "Dit bestand blijkt een valse afbeelding te zijn. Het omvat de GIF marker maar ook php code. Het bevat hoogstwaarschijnlijk ook een virus.",
    "HOME": "https://www.avonture.be",
    "HOMETITLE": "AVONTURE Christophe aka cavo789",
    "IGNORE_ARCHIVE": "Archieven",
    "IGNORE_DOCUMENTS": "Documenten",
    "IGNORE_EXTENSIONS": "Negeert de volgende extensies : %s",
    "IGNORE_FONT": "web lettertype",
    "IGNORE_IMAGES": "Afbeeldingen",
    "IGNORE_MEDIA": "Media (andere dan afbeeldingen)",
    "IGNORE_MOVIES": "Animaties",
    "IGNORE_TEXTES": "Tekst (andere dan html)",
    "IGNORE_TITLE": "Negeer de volgende bestanden:",
    "INFO": "Informatie",
    "JS_CONFIRMKILL": "Weet je zeker dat je het bestand %s wil verwijderen?",
    "JS_FILENOTFOUND": "<div class=\"alert alert-danger\"><strong>Bestand niet gevonden of status alleen-lezen</strong></div>",
    "JS_KEEPWHITELIST": "Nadat aeSecure een aantal veilige bestanden heeft gevonden zal er een bestand aesecure_quickscan.whitelist.json op uw site worden geplaatst.\\n\\nWilt u dit bestand behouden zodat de volgende keer bij een aeSecure Quickscan deze bestanden niet meer in de lijst komen?\\n\\nKlik op OK om het bestand te behouden.",
    "JS_UNLINKERROR": "<div class=\"alert alert-success\"><strong>Het bestand kon niet worden verwijderd</strong>Onbekende fout</div>",
    "JS_UNLINKSUCCESS": "<div class=\"alert alert-success\"><strong>Het bestand is verwijderd</strong></div>",
    "KILL_FILE": "Verwijder dit bestand",
    "KILL_FILE_HINT": "<span class='text-danger' style='font-size:1.2em;'><strong>Wis bestand</strong><br/>Na bevestiging, wordt het bestand definitief verwijderd van de server.<hr/>Dit houdt een rsisico in en kan problemen veroorzaken met uw site.</span>",
    "LASTMOD": "Datum laatste wijziging",
    "MD5": "Hash van het bestand op basis van de inhoud (indien de inhoud, ook veranderd er slechts één enkele byte, dan is de hash toch helemaal anders).",
    "NOTHINGFOUND": "Goed nieuws! Geen verdachte bestanden gevonden op uw site. Merk echter op dat deze scan aanwezigheid van virussen niet uitsluit.",
    "NOTUSINGHASHESSHORT": "Geen hashes gevonden",
    "OK": "Ok",
    "PAGETITLE": "aeSecure QuickScan - On-site malware detectie script",
    "PATTERN": "Handtekening",
    "POTENTIALLY": "<Strong> Houd er rekening mee dat de hieronder genoemde bestanden niet altijd virussen bevatten, het aantal \"valse positieve meldingen\" kan zeer hoog liggen. </strong> Een \"valse positieve melding\" is een bestand dat in de scanresultaten staat maar zonder dat het een virus bevat.",
    "QUICKSCANFAQ": "Om een oplossing te vinden voor dit probleem, raadpleeg de <a href=\"%s#faqs\" target=\"_blank\">FAQ van aeSecure QuickScan</a>",
    "RUNNING": "Scan bezig...",
    "SAFE": "Veilig",
    "SCANFILES": "Scan %s bestand(en)",
    "SCANFOLDER": "Te scannen map :",
    "SEE_FILE": "De inhoud van het bestand",
    "SEE_FILE_HINT": "<strong>De inhoud van het bestand</strong><br/>Opent een nieuw tabblad in uw browser, zodat de broncode van het bestand wordt weergegeven.<hr/><span class='text-success'>Als het bestand een php script is, zal het niet worden uitgevoerd. De broncode bekijken houdt geen risico in.</span>",
    "SELECT_LANGUAGE": "Kies je taal",
    "SEND": "Zend",
    "SORRYNOHASHES": "Sorry, de bestanden die de handtekening van uw CMS% s v.% S bevatten zijn niet gevonden. Het scannen van uw website zal veel meer tijd in beslag nemen.",
    "STATUS": "Status",
    "SUCCESS": "Succes",
    "THOUSANDSEPARATOR": ".",
    "TOOBIG": "Dit bestand is overgeslagen omdat de grootte de maximum toegelaten waarde (%s) overschrijdt",
    "UNREADABLE": "Dit bestand, hoewel de chmod correct is, is onleesbaar; mogelijks als gevolg van speciale tekens in de naam.",
    "USINGHASHES": "Scanoptimalisatie",
    "USINGHASHESINFO": "De hash van de core bestanden van uw site %s %s werden gedownload. Ze worden gebruikt om het scannen van je site te versnellen: de niet gewijzigde bestanden van uw CMS zullen niet worden gescand en daarom worden genegeerd.",
    "USINGHASHESSHORT": "Hashes gevonden.",
    "VIRUSFOUND": "Als de resultaten van dit script op de aanwezigheid van virussen wijzen, begrijp dan dat het script slechts oppervlakkig werkt omdat er gezocht werd naar bekende malware (zwarte lijst) en een zeer beperkt aantal viruspatronen. Er kunnen dus nog andere verborgen virussen op uw site voorkomen. Een volledige scan van uw site moet worden overwogen om deze te verwijderen. Aarzel niet om contact met mij op te nemen: <a href=\"%s\" target=\"_blank\">% s </a>, ik kan uw website helemaal virus vrij maken.",
    "WARNING": "Opgelet",
    "WARNINGBASE64ENCODEDPATTERN": "Virusauteurs gebruiken soms \"base64\" codering om hun virale code te verbergen; sommige PHP sleutelwoorden zoals \"eval\" of \"systeem\" staan de uitvoering van een code toe en de handtekening die hier wordt genoemd kan riskant zijn. Om base64 code te decoderen, kunt u verschillende \"base64_decode\" decoders gebruiken die beschikbaar zijn op het net, zoals https://base64.avonture.be/",
    "WARNINGNOTMANDATORYAVIRUS": "Dit is niet noodzakelijk een virus! : het gebruikte trefwoord is verdacht",
    "WHITE_LIST": "Zet dit bestand als veilig",
    "WHITE_LIST_HINT": "<strong>Voeg dit bestand toe aan de witte lijst.</strong><br/>Als je het bestand wil schrappen uit de lijst van verdachte bestanden en je weet dat het bestand virusvrij is, voeg het dan toe aan de witte lijst."
}
