{
  "SELECT_LANGUAGE": "Select your language",
  "SCANFILES": "Scan %s file(s)",
  "QUICKSCANFAQ": "To find a solution to this problem, please check out the <a href=\"%s#faqs\" target=\"_blank\">FAQ of aeSecure QuickScan</a>",
  "ALERTINFO": "This script, given free of charge by <a href=\"%s\" target=\"_blank\">aeSecure</a>, a protection and optimization software solution for Apache websites, will scan your entire site to search for some virus 'patterns'  <span style=\"font-style:italic;\">(for performance reasons, files over %s will be ignored).</span><span class=\"newline underline\">The action of the script consists in running a scan: by default no file deletion will be made so there is no risk to run it on your site.</span>",
  "FILESFOUND": "%d  files were analyzed of which %d were detected as <span class=\"double_underline\" data-toggle=\"popover\" data-html=\"true\" data-content=\"%s\">potentially</span> dangerous.<br/>%d files have been ignored because their size is greater than or equal to %d MB and %d files were inaccessible due to a permission level (chmod) which is too restrictive.",
  "VIRUSFOUND": "If the results of this script showed the presence of viruses, please understand that the script is superficial since it searched for known malware (blacklist) and a very limited set of virus patterns.   You must therefore expect to have other hidden viruses on your site.  An exhaustive scan of your site should be considered to delete them. Don't hesitate to contact me : <a href=\"%s\" target=\"_blank\">%s</a>, I can clean your website.",
  "GETCOUNTFILESDONE": "%s files will be analyzed <strong id=\"virusalreadyfound\" class=\"text-danger blink\">with %s already identified as viruses</strong> <strong id=\"virusaddedfound\" class=\"text-danger blink\">with %s having virus in it</strong> <span class=text-success\">(%s files have been skipped because they are listed on the white list of aeSecure and %s ignored as requested in the advanced options screen)</span>.",
  "FILES": "%s files",
  "ERROR_NOFILESFOUND": "<div class='text-danger'>Sorry, no files have been found in this folder.</div>",
  "USINGHASHES": "Scan optimization",
  "USINGHASHESINFO": "The hash of core files of your site %s %s have been downloaded. They will be used to speed up the scan of the site: thge untouched files of your CMS won't be scanned and therefore will be ignored.",
  "USINGHASHESSHORT": "Hashes found",
  "SORRYNOHASHES": "Sorry, the files bearing the signatures of your CMS %s v.%s have not been found. Scanning  your website will take much more time.",
  "NOTUSINGHASHESSHORT": "No hashes found",
  "CLEANFOLDER": "The folder %s has been cleaned",
  "CLEANING_URL": "https://www.aesecure.com/fr/telechargement.html#services",
  "CLEANFORYOU": "I can clean your website",
  "GETTINGFILES": "Getting the list of files... Please wait.",
  "WHITE_LIST_HINT": "<strong>Add this file to the whitelist.</strong><br/>If you don't want this file anymore in the list of suspicious files and you know that the file is clean, add it to the whitelist.",
  "JS_CONFIRMKILL": "Are you sure you want to remove the file %s ?",
  "JS_UNLINKSUCCESS": "<div class=\"alert alert-success\"><strong>The file has been removed</strong></div>",
  "JS_FILENOTFOUND": "<div class=\"alert alert-danger\"><strong>File not found or read-only status</strong></div>",
  "JS_UNLINKERROR": "<div class=\"alert alert-success\"><strong>It was impossible to remove the file</strong> Unknown error</div>",
  "JS_KEEPWHITELIST": "After identifying somes files as safe, aeSecure has created a file called aesecure_quickscan.whitelist.json on your site.\\n\\nWould you like to keep this file so that the next time you'll use aeSecure QuickScan again, these files won't be listed again?\\n\\nClick on OK to keep the file.",
  "WHITE_LIST": "Flag this file as safe",
  "POTENTIALLY": "<strong>Please bear in mind that the files mentioned below are not necessarily viruses, the number of \"false posivite\" being very high.</strong> A \"false positive\" is a file that is mentioned in the scan results but without being a virus.",
  "MD5": "Hash of the file based on its content (if the content is changed even by only one single byte, the hash will be completely different).",
  "KILL_FILE": "Kill this file",
  "KILL_FILE_HINT": "<span class='text-danger' style='font-size:1.2em;'><strong>Delete file</strong><br/>After your confirmation, the file will be permanently deleted from the server.<hr/>This operation is risky and could lead to problems in your site.</span>",
  "SEE_FILE": "See the content of the file",
  "SEE_FILE_HINT": "<strong>See the content of the file</strong><br/>Opens a new tab in your browser so as to display the source code of the file.<hr/><span class='text-success'>Il the file is a php script, in no way will the file be executed. Viewing its source code is not risky.</span>",
  "HIGHPROBALITYBADSITE": "This website is known to be bad.",
  "HIGHPROBALITYBASE64KEYWORD": "This is a base64 encoded word  and corresponds to a php reserved word like e.g. $_SERVER or $_COOKIES.  This code may well be dangerous.",
  "HIGHPROBALITY": "High probability that this file is a virus or has been virused.",
  "WARNINGNOTMANDATORYAVIRUS": "This is not necessarily a virus! but the keyword used is suspicious",
  "WARNINGBASE64ENCODEDPATTERN": "Virus authors sometimes use \"base64\" coding to hide their viral code; some PHP keywords such as \"eval\" or \"system\" allow the execution of a code and the signature that is mentioned here can be risky. To decode base64 code, you can use different \"base64_decode\" decoders available on the net, such as https://base64.avonture.be/",
  "DIRNOTFOUND": "The  %s folder doesn't exist.",
  "SCANFOLDER": "Folder to be scanned :",
  "BADCHMOD": "This file is not accessible: its 'chmod' does not permit reading it.",
  "UNREADABLE": "This file, although its chmod is correct, is unreadable; perhaps because of special characters in its name.",
  "TOOBIG": "This file has been skipped because its size exceeds the maximum allowed size (%s)",
  "INFO": "Information",
  "SAFE": "Safe",
  "STATUS": "Status",
  "SUCCESS": "Success",
  "LASTMOD": "Last mod. date",
  "DEBUGMODEENABLED": "Debugging mode enabled (the %s file will be used for logging)",
  "NOTHINGFOUND": "Good news ! No dangerous signature has been detected on your site. Note however, that this scan is by no means exhaustive.",
  "HIDERESULT": "Hide this result",
  "HIGHPROBALITYFALSEGIF": "This file appears to be a false picture. It contains the GIF marker but, also, a PHP code; so it's most likely a virus.",
  "RUNNING": "Scan in progress...",
  "ALERTWARNING": "Some considerations to understand&nbsp;:&nbsp;<br/><br/><ol><li>The scan is superficial and by no means exhaustive; only a few signatures have been searched while hacking possibilities are very numerous,</li><li>if the script detects the presence of certain signatures (e.g. \"base64_decode\"). This doesn't mean that your site has been hacked. Indeed, some instructions are used in a hack (like base64_decode) but are also used in safe source code,</li><li>Results should <strong>ALWAYS</strong> be properly understood before taking any action. Ask for help on a forum e.g. if you doubt.</li><li>This script is not optimized : the scan is done file by file and can take more or less time depending on the complexity of your site.</li></ol>The script author accepts no responsibility for any liability for misuse of the script or action taken by the webmaster.",
  "PATTERN": "Signature",
  "FOUNDPOSITION": "Found in position <strong>%s</strong> in the file; here's the context :",
  "EDITED": "<strong class=\"text-danger\">This file contains a virus, you have to edit it to remove the infected code.</strong>",
  "BLACKLISTED": "<strong class=\"text-danger\">This file is known as bad.  Tip: delete it.</strong>",
  "DANGER": "Danger",
  "WARNING": "Warning",
  "BTNCLEAN": "Clean the cache and temp folders",
  "BTNCLEANDONE": "Cleaned",
  "BTNCLEANHINT": "By first removing unneeded files (cache and temp folders), you'll reduce the number of files to scan, so scanning will be be faster.",
  "PAGETITLE": "aeSecure QuickScan - On-site malware detection script",
  "BTNKILLME": "Remove this script from the server",
  "BTNKILLMEDONE": "Script removed",
  "BTNKILLMEHINT": "Do not keep this script on your server. Once the analysis is over, click on this button to remove the script.",
  "THOUSANDSEPARATOR": ",",
  "HOME": "https://www.aesecure.com/en",
  "HOMETITLE": "aeSecure, protection and optimization of Apache websites",
  "QUICKSCANURL": "https://www.aesecure.com/blog/aesecure-quickscan.html",
  "DESCRIPTION": "aeSecure QuickScan is a php script to put on your website and to start from a URL in order to scan your website and search for viruses, malware, trojans, Black hat SEO, ...",
  "BTNGETLIST": "Getting the file list",
  "BTNGETLISTHINT": "Please click on this button to initialize the scanner and enable it to determine the number of files to scan",
  "BTNSCAN": "Scan the site",
  "BTNSCANHINT": "Starts scanning the site; this may take time.",
  "IGNORE_ARCHIVE": "Archives",
  "IGNORE_DOCUMENTS": "Documents",
  "IGNORE_FONT": "Webfont",
  "IGNORE_IMAGES": "Images",
  "IGNORE_MEDIA": "Media (other than images)",
  "IGNORE_MOVIES": "Animations",
  "IGNORE_TEXTES": "Text (other than html)",
  "IGNORE_EXTENSIONS": "Ignores the following extensions : %s",
  "EXPERT_MAXFILES": "%s files at a time",
  "ALL": "All",
  "APPLY": "Apply",
  "ADVANCED_OPTIONS": "Advanced options",
  "EXPERT_MODE": "Expert mode",
  "DEBUG_MODE": "Debug mode",
  "CANCEL": "Cancel",
  "SEND": "Send",
  "OK": "Ok",
  "IGNORE_TITLE": "Ignore the following files:"
}
